[{"Category":"Professional Services","Description":"Duties include, but are not limited to: · Companionship · Light housekeeping tasks and meal preparation · Medication and appointment reminders · Assistance with grooming and bathing · Assistance with toileting and incontinence issues · Alzheimer\/Dementia Care","Title":"Care Giver","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/CAREGiver-(987).aspx","Contact":"khayes@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"PARAMED IS NOW HIRING PSWS IN: WINDSOR, LASALLE, ESSEX, HARROW, AMHERSTBURG, COTTAM, KINGSVILLE, LEAMINGTON, TECUMSEH, LAKESHORE The Personal Support Worker (PSW) will provide individualized care that is sensitive to the clients’ unique needs, providing assistance with Activities of Daily Living (ADL’s) and Independent Activities of Daily Living (IADL’s) through a client specific assignment working under the direction of and in collaboration with a regulated health care professional. Care will take place in the community, within a client’s home. What does “Redefining care” mean to you? ParaMed needs team members who share our goal of redefining care in the home. Join Canada’s largest home health care company and make a real difference in the lives of people in your community. We provide quality, compassionate care directly to clients where they live because we believe that when you are in need of care, home is a more comfortable place to be! Choose ParaMed for support, where we’ll provide you with paid orientation, mentorship, and ongoing training. Experience diversity and life long learning – where the skills that you learn contribute to making you a confident and accomplished care professional. Right now, we are currently looking for Personal Support Workers in Windsor-Essex. ParaMed offers you: Competitive compensation Health and dental benefits Use of Mobile device Mileage\/travel allowance Training and skills development Full and part time positions available Career Advancement opportunities Employee purchase discount programs A supportive and respectful workplace Autonomy and independence This is a Union Position – Service Employees International Union Local 1 Canada, Windsor Essex County Union Classification: Personal Support Services (PSS)","Title":"PSW ","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Full-Time-PSW-Paramed-(1202).aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"The Registered Nurse (RN) or Registered Practical Nurse (RPN) will practice in accordance with legislation and the standards as determined by their regulatory body and the practice setting. The RN or RPN will have the knowledge to asses, select, implement and evaluate a wide range of nursing interventions to ensure consistent, safe, competent and ethical care. Client groups receiving care may include Pediatrics and\/or Adults with complex medical\/health concerns. Care will take place within the community within a residential or institutional setting with referrals generated by a variety of sources including government agencies, employers, insurance companies or private payees. What does “Redefining care” mean to you? ParaMed needs team members who share our goal of redefining care in the home. Join Canada’s largest home health care company and make a real difference in the lives of people in your community. We provide quality, compassionate care directly to clients where they live because we believe that when you are in need of care, home is a more comfortable place to be! Choose ParaMed for support, where we’ll provide you with paid orientation, mentorship, and ongoing training. Experience diversity and life long learning – where the skills that you learn contribute to making you a confident and accomplished care professional. Right now, we are currently looking for Registered Nurses and Registered Practical Nurses. Responsibilities Obtains informed consent prior to and throughout service provision • Working collaboratively with a multi-disciplinary team consisting of government agencies, healthcare workers, and other community resources Provides safe, competent, compassionate and ethical nursing care to ensure the personal safety of clients Uses appropriate assessment tools and techniques in consultation with clients and the health care team to assess clients regarding physical, emotional, spiritual, cultural, cognitive, developmental, environmental and social needs Engages client using a collaborative approach, building rapport and trust, achieving a mutual understanding and agreement to identify actual and potential client health care needs, strengths, capacities and goals. Establishes and maintains appropriate professional boundaries with clients and the health care team, including the distinction between social interaction and therapeutic relationships • Participates in necessary care conferences with Health Care team Maintains the knowledge, skills and attitudes to provide safe, efficient, effective care in all areas of practice by keeping abreast of changes in practice setting that affect scope of practice Maintains professional client records related to client encounters and plans in compliance with ParaMed’s policies and the standards applied by their regulatory body. Shows respect for cultural needs, dignity, privacy and confidentiality of clients Discharges client when goals have been achieved. Other duties as assigned ParaMed offers you: Competitive compensation Health and dental benefits Use of Mobile device Mileage\/travel allowance Training and skills development Full and part time positions available Career Advancement opportunities Employee purchase discount programs A supportive and respectful workplace Autonomy and independence If you share these same goals and values, let's talk - we'd love to have you on our team! *In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and ParaMed Policies on Accommodation, a request for accommodation will be accepted as part of ParaMed hiring process.* $4\/hour wage enhancement to front line team members for all hours worked until August 13. In addition, front line team members will be eligible for an additional $250\/month when they have worked 100 hours.","Title":"RN\/RPN ","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Registered-Practical-Nurse-(1206).aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Construction","Description":"Full time window tinter for automotive and residential work. Must be able to work with basic hand tools. Must be able to Disassemble and reassemble door panels.","Title":"Window Tint Technician (714)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Window-Tint-Technician-(714).aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Agriculture \/ Fisheries","Description":"processing, packaging, canning and distribution of frozen vegetable products · Ability to work in a physically demanding work environment where you will be required to move wheelbarrows, fill totes and perform extensive cleaning; · Ability to stand for extended periods of time as sitting is not an option; · Ability to work outside in varying weather conditions as some of our team work outside as part of their cleaning and waste removal duties; · Ability to work in a fast paced dynamic team environment to ensure the processing of a perishable product; · Good eye\/hand coordination to ensure that any foreign material is removed before further processing; · Good attention to detail for the purpose of record maintenance; · Ability to follow directions in order to meet our expectations regarding health and safety and food safety","Title":"General Labourer","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/General-Labourer.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Agriculture \/ Fisheries","Description":"responsible for prepping and cleaning the tunnels and line prior to production runs involves cleaning with high pressure hoses and cleaning chemicals · Ability to stand for extended periods of time as sitting is not an option; · Ability to work outside in varying weather conditions as some of our team work outside as part of their cleaning and waste removal duties; · Ability to work in a fast paced dynamic team environment to ensure the processing of a perishable product; · Good eye\/hand coordination; · Ability to follow directions in order to meet our expectations regarding health and safety and food safety; · Demonstrate punctuality and reliability; Demonstrate flexibility and willingness to learn","Title":"Sanitation General Labourer","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Sanitation-General-Labourer.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Transportation \/ Logistics","Description":"We are currently looking for HWY \/ CROSS border drivers to hire for dedicate lanes. . All our equipment is BRAND NEW. We also hiring city drivers. We provide health benefit plans. We are based out of Milton & Windsor, ON terminals; along with Montreal, QC. Job Description: - Seeking Professional and experienced AZ Drivers! - New trucks available - Freightliners, Volvos & Internationals! - Steady mileage per month + - Singles and Teams: Lots of Mileage! - Full paid training - 2 years of experience NEEDED - We are Smartway and CTPAT Certified! - We pay direct deposit - In Business for 10 years! Requirements: - Must have positive attitude - Must have VERIFIED at least 2 years’ experience","Title":"AZ Driver","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/AZ-Driver.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"Understand care plans and determine ways to implement them effectively Assist patients with ambulation and positioning and provide them support in bathing, toileting, dressing and grooming Ensure that patients’ food is prepared according to a specific healthcare plan and assist them in partaking their meals if required. Perform light housekeeping duties such as dusting, washing dishes, folding laundry Change bed linens when required. Provide emotional support to distressed patients and provide them with companionship Monitor changes in patients’ behavior and report any significant observations to families, healthcare provider and supervisor. Ensure patient dignity by keeping personal and medical information confidential Ensure a clean, safe and healthy environment for patients to help them thrive both physically and emotionally Recognize emergency situations and escalation process and perform First Aid and CPR in dire circumstances","Title":"Personal Support Worker\/PSW","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Personal-Support-WorkerPSW.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Repair \/ Maintenance","Description":"8am-5pm,+ keeping work phone every other weekend Maintain high rise apartment building with some retail space Repair doors, cabinets, drywall , flooring","Title":"Maintenance Worker","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Maintenance-Worker.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Professional Services","Description":"· Identify customer needs and meets or exceeds expectations. · Manage customer calls and meet sales objectives. · Develop and maintain auto and property insurance product knowledge expertise. · Correctly input customer underwriting information into a quoting system. · Generate a premium estimate and discuss product and price options with the client. · Sell the policy based on the features of the product and the company. · Up-sell and cross-sell policy coverage. · Answer inquiries about coverage, deductibles, processes, claims, etc.","Title":"Sales Insurance Broker","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Sales-Insurance-Broker.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Professional Services","Description":"As a Service Insurance Broker for home and auto insurance you will receive paid training, a competitive salary and benefits package along with opportunity for growth within our group of companies. Compensation for this position is a base salary + incentives. • Assess client needs, advise client on recommendations and execute on all important details • Create an effortless experience for our customers • Demonstrate strong decision-making and analytical skills • Underwrite and process requested changes • With experience and training, develop understanding of the insurers’ underwriting guidelines • Use sound underwriting judgment when reviewing and modifying policies","Title":"Service Broker","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Service-Broker.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Retail \/ Sales and Services","Description":"The Customer Service and Sales Representative (CSSR) role may be an ideal place to start your career in financial services. You will spend almost all your time working with the most important asset, our customers, in person and over the phone. CSSRs are able to handle a variety of tasks including providing exceptional customer service in all customer interactions, they help resolve customer concerns, manage risk and process account transactions Successful CSSRs demonstrate a genuine interest in their customers and ask questions to understand what's important to them and how to meet their financial needs. CSSRs are able to present options to customers about ways to make their loans and financial services easy and convenient, while ensuring the needs of the customer always come first. CSSRs work in a challenging, high change environment. There is no typical day — that's part of the challenge, and the fun. On any given day, you're expected to: Meet or exceed business goals and performance objectives Identify the 'details' that others miss, and take pride in accuracy of data and business records Process transactions for customers, manage risk and resolve accounts Work as part of a team, including weekends and holidays as needed or scheduled","Title":"Customer Service \/ Sales Representative (1310)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Customer-Service--Sales-Representative-(1310).aspx","Contact":"bsweet@citywindsor.ca"},{"Category":"Retail \/ Sales and Services","Description":"As a manager, you will demonstrate leadership through contributing to a company culture that supports customers in achieving their financial goals, team members in developing their careers, and helping your team understand and be inspired by their connections to the Vision, Values and Strategies. The Manager role models for building lifelong relationships with customers, both consumers and small businesses. They foster a positive work environment where team members are encouraged, motivated and developed to achieve their maximum potential by leveraging coaching and performance management tools and processes. Managers are responsible for the operational success of the branch. They possess in-depth knowledge of our products, procedures and systems, and they have strong financial acumen. On any given day, you’re expected to: Effectively manage time and competing priorities in a faced paced, high change retail environment Go above and beyond standard job responsibilities Work effectively in a team environment and across all organizational levels; where flexibility, collaboration, and adaptability are important Administer and govern compliance with policies and procedures, applicable laws and regulations Analyze financial metrics, data and branch performance Develop strategic partnerships to grow the business Administer operational compliance controls, credit and risk management, and loss prevention Work as part of a team, including weekends and holidays as needed or scheduled","Title":"Branch Manager (1311)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Branch-Manager-(1311).aspx","Contact":"bsweet@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"Assemble, repair molds used in manufacturing industry to mass-produce plastic or metal components and products Build molds according to customer requirements, specifications, and industry-accepted guidelines. Interpret accurate design information relative to build activity. Hydraulics, manifolds, welding, spotting all performed on site Set up\/operate lathes and milling, grinding, drilling, to achieve tight tolerances. Read\/interpret CAD files and other product-related diagrams, charts or tables. Select mechanical measuring, checking and layout tools and devices, and performing measuring, checking and layout operations. Select work piece materials, cutting tools and abrasives for metal removal","Title":"Tool Maker","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Tool-Maker.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"· Create mold designs for the manufacturing of automotive, commercial, recreational and domestic product items using in house CAD software and technologies · Design molds according to customer requirements, specifications, and industry-accepted guidelines. · Record accurately design information relative to design and build activity of molds. · Maintain up-to-date job history files. · Apply in depth knowledge of Design for Injection Molded Plastics Technology. · Design structural foam, gas assist, multi-shot, thermoset and compression molds. · Efficient capabilities in surface creation and part development. · Ability to create feasibilities to present solutions.","Title":"Senior Mold Designer","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Senior-Mold-Designer.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Transportation \/ Logistics","Description":"Looking for AZ Driver with Float and Dump experience (minimum 2 year) to haul construction equipment Will also be doing manual labour Clear Abstract and CVOR","Title":"AZ Driver wtih Float and Dump Experience","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/AZ-Driver-wtih-Float-and-Dump-Experience.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Construction","Description":"Uzor Manufacturing is a fast-growing window & door manufacturing company currently accepting resumes for a Finish Carpenter. Ideal candidates must be reliable, have a high attention to detail and excellent workmanship. This is an entry level position with room for future advancement within the company.","Title":"Finishing Carpenter","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/1320.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"Assisting residents with bathing, grooming, dressing, toileting. Will make beds, do laundry and other related duties.","Title":"Health Care Aide","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Health-Care-Aide.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Accounting \/ Bookkeeping","Description":"Responsibilities for the Assistant Financial Controller include, but are not limited to: Manage project accounting reports to ensure timely updates weekly Provide financial communication to the management team, the project managers and the internal accounting department Ensure financial information accuracy between all levels of the organization Conduct cost variance analysis Recommend and execute corrective actions Monitoring cost and commitment through requisition and invoice review Ensuring adherence to best practices Maintains financial staff job results by coaching, counseling, and disciplining employees; planning, monitoring, and appraising job results. Responsible for daily auditing of invoice pricing, processing of invoices, and maintenance of A\/R and A\/P related data files Provide research and analysis support Willingness to perform a wide variety of administrative and financial tasks Office administration duties Complete assigned tasks in a timely and efficient manner Adhere to all company policies and procedures Represent company in a professional and courteous manner at all times Other duties as assigned","Title":"Assistant Financial Controller","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Accounting-.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Construction","Description":"On-site problem diagnosis, fixed right the first time and continual value-added communication with the home owner Install, maintain and repair all types of home heating and air quality systems, as well as refrigeration systems and other equipment used to distribute, or supply ventilation; including systems in multi-unit residential buildings Diagnose the cause of problems or failures in HVAC systems Travel to job sites, work with dispatch to ensure schedule is maintained. Communicate progress and possible delays to customer Install or replace components or entire systems Perform regularly scheduled maintenance, and performance checks Ability to read and interpret schematics, drawings, and installation instructions Set priorities and work assignments to meet established deadlines Perform diagnostics, repair, maintain, service and install equipment in accordance with manufacturer specifications Adhere to all safety rules and procedures and relevant regulatory requirements. Perform general and specific equipment inspections Correctly instruct customers on proper care and maintenance Maintain up-to-date knowledge of all modern equipment and regulations Explain the value of the company's products, services and programs on every call Adhere to all company policies and procedures Represent company in a professional and courteous manner at all times Other duties as assigned","Title":"Residential HVAC Technician","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Residential-HVAC-Technician.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"General Labour","Description":"Local roofing company is in need of experienced roofing labourers to help with the installation of our asphalt, metal and flat roofing systems. The daily tasks would include; Setting up job sites Tearing off and disposing of old roofing systems Facilitating the installation of new materials The perfect candidate will be outgoing, motivated and professional","Title":"Roofing Labourers (1337)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Roofing-Labourers-(1337).aspx","Contact":"bsweet@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"The Mold Maker is responsible for carrying out instructions for the repair and building of molds and mold components Perform work required and maintain a clean work environment Assure own equipment is calibrated","Title":"Mold Maker","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Mold-Maker.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"The Machinist \/ CNC Operator is responsible for overseeing all machining activities as directed by the Machining Manager. Program computer numerically controlled (CNC) machine tools Assist in job prioritization to meet deadlines Safely operate overhead cranes Inventory of products required to perform work required and report to the machine leader Maintenance of machining equipment Ensure own equipment is calibrated Comply with all Health & Safety policies throughout facility","Title":"Machinist\/CNC Operator","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/MachinistCNC-Operator.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Repair \/ Maintenance","Description":"On-site problem diagnosis, fixed right the first time and continual value-added communication with the home owner Install, maintain and repair all types of piping systems, fixtures and other equipment used to distribute, supply or dispose of water or wastewater; including fixtures systems and appliances in residential buildings Locate and mark positions for pipe connections, passage holes and fixtures in walls and floors cut opening in walls and floors to accommodate pipe and pipe fittings Measure, cut, bend and thread pipes using hand and power tools or machines Join pipes using couplings, clamps, screws, bolts, cement or soldering, brazing and welding equipment Test pipes for leaks using air and water pressure gauges Set priorities and work assignments to meet established deadlines Perform diagnostics, repair, maintain, service and install equipment in accordance with manufacturer specifications Adhere to all safety rules and procedures and relevant regulatory requirements. Perform general and specific equipment inspections Correctly instruct customers on proper care and maintenanceMaintain up-to-date knowledge of all modern equipment and regulations Explain the value of the company's products, services and programs on every call. Adhere to all company policies and procedures. Represent company in a professional and courteous manner at all times. Other duties as assigned.","Title":"Residential Plumber","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Residential-Plumber.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"once a week for five hours in the morning (either Monday or Thursday from 7am-12noon). This client requires 24\/7 care and the hours have the potential to increase as well as retirement home and LTC placement when Covid allows us to visit multiple places. The main criteria is confidence in G tube feeding and deep suctioning. The wage starts at $24 per hour and PSW work is available if they wish for more hours.","Title":"RPN","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/RPN.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Retail \/ Sales and Services","Description":"Demonstrates that guest service is their number one priority Makes a positive first impression: smiles, makes eye contact, maintains a positive tone of voice and always says thank you Responds to guests in a friendly manner with an appropriate sense of urgency Suggests products and complimentary items appropriately Resolves guest concerns and complaints in a friendly manner Follows proper cash procedures Excellent knowledge of Cannabis products and regulations Trustworthy and guest-oriented","Title":"Budtender","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Budtender.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Office Assistant","Description":"Great opportunity for business\/marketing grad Schedule employees and ensure sufficient and correct employees are on th efloor at all times Learn other assistaat manager duties Demonstrates that guest service is their number one priority Makes a positive first impression: smiles, makes eye contact, maintains a positive tone of voice and always says thank you Responds to guests in a friendly manner with an appropriate sense of urgency Suggests products and complimentary items appropriately Resolves guest concerns and complaints in a friendly manner Follows proper cash procedures Excellent knowledge of Cannabis products and regulations Trustworthy and guest-oriented Open\/close the store as required Attend training events to help build your cannabis knowledge to better serve our customers Clean the store as part of opening and closing duties","Title":"Budtender_Office Support","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Budtender_Office-Support.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Warehousing \/ Distribution","Description":"· Ensure all label jobs are set-up accurately each day, including machine preparation · Perform daily periodic maintenance on all assigned label machines · Manage and perform daily checks on product Coding machine · Participate in daily production through running a label machine or other positions as assigned · Perform assisted changeovers on assigned label machine(s) · Ability to perform basic in-line quality\/process checks on labelled products · Maintain a clean and safe workplace in accordance with 5S protocols and SOP’s · Oversight activities and processes post labelling machine Dutifully follow best practices and safety requirements Attend and engage in meetings as required Other duties as assigned","Title":"Production Labelling Operator","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Production-Labelling-Operator.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Warehousing \/ Distribution","Description":"Ownership over the entire canning process from can depalletization through rince, fill, seaming and downstream can treatment process Manage and operate the depalletizer to provide the line with a steady supply of cans Operation and optimization of the filler\/seamer to ensure consistent quality product is produced at optimized run-rates Collaborate closely with blending lead to ensure overall line optimization Manage canning line team in support of downstream processes Load, set up, take down and unload equipment at the start and end of canning runs Operate all aspects of canning line: filling, CIP, troubleshooting, & maintenance Conduct or direct maintenance activities on all canning line machinery Ensure that all beverages are produced to Peaks high standards and specifications Dutifully follow best practices and safety requirements Attend and engage in meetings as required","Title":"Canning Line-Lead Operator","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Canning-Line-Lead-Operator.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Cleaner \/ Caretaker","Description":"Works closely with the Maintenance department to address any maintenance related issues that arise or that would affect the production of healthy, sanitary products and building repairs Works closely with Quality to achieve the desired level of sanitation for adequate food processing as per our approved Sanitation Program. Responsible for following a Master Sanitation Schedule of items that require periodic attention Follow Sanitation Standard Operational Procedures (SSOP's) for all sanitation activities as per SQF guidelines and Cannabis Regulations. Establish daily sanitation priorities based on visible inspection, production requirements and routine sanitation schedule. Participate in monthly Food Safety audits and initiate corrective action for any non-conformances and by taking preventative measures to ensure conformance to the food safety standard established by Peak. Use approved chemicals and appropriate dilutions to clean and disinfect equipment and surfaces Disassemble, sanitize, and reassemble cannabis processing equipment Clean and sanitize production and processing rooms Restock soap, sanitizer, and personal protective equipment (PPE) in the designated areas Perform general cleaning duties; remove trash and garbage to designated areas and sweep and mop floors Ensure safe handling and disposal of chemicals, and compliance with OHSA, WSIB, MOL regulations. Responsible for sanitation inventory management, cost reduction and efficiency improvements. Able to work 12 hour continental shift.","Title":"Sanitation Associate","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Sanitation-Associate.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"Local printing company is looking for a candidate to operating their Silk-Screen Press. Daily tasks would include: Taking and processing detailed customer orders Using computer programs and software to develop designs to apply to different materials Operating Silk-screen press Other duties as assigned","Title":"Silk-Screen Operator - (1369)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Silk-Screen-Operator---1369.aspx","Contact":"bsweet@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"Local printing company is looking for a candidate to operate their Heat Press. Daily tasks would include: Taking and processing detailed customer orders Using computer programs and software to develop designs to apply to different materials Operating heat press Other duties as assigned","Title":"Heat Press Operator (1370)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Heat-Press-Operator-(1370).aspx","Contact":"bsweet@citywindsor.ca"},{"Category":"Information and Communications Technology","Description":"Daily Tasks would include: Write, modify, integrate and test software code for e-commerce and other internet applications Maintain exisiting computer programs by making modifications as required Identify and communicate technical problems, processes and solutions Prepare reports, manuals and other documentation on the status, operation and maintenance of software Assist in the collections and documentation of user's requirements Research and evaluate a variety of software products","Title":"Computer Programmer (1391)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Computer-Programmer-(1391).aspx","Contact":"bsweet@citywindsor.ca"},{"Category":"General Labour","Description":"Local company is seeking a Furniture Handler for residential, and commercial moves. Load, unload and move products and materials by hand or using basic material handling equipment Move household and office appliances and furniture onto and off moving trucks or vans Perform other material handling activities such as counting, weighing, sorting, packing and unpacking. Looking for a candidate that is eager to learn and will accept an entry level position with chance for increased responsibility.","Title":"Furniture Handler","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Furniture-Handler.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"Centrally located Retirement home providing Independent and Assisted Living is seeking qualified Personal Support Workers. The Personal Support Worker, under the direction of the immediate Supervisor, provides Resident Focused care services to Residents and assists Residents with the activities of daily living as described in the care plan, and in accordance with all required internal standards of practice which are in accordance with the Resident Bill of Rights, Retirement Home Act and The Retirement Home Regulatory Authority. DUTIES AND RESPONSIBILITIES Provide personal care that is within the provincial scope of practice for a Personal Support Worker; duties may include skin care, hair care, mouth care, bathing, bowel and bladder care, positioning and movement, exercise, basic wound care, feeding including special diets, and assistance with oxygen administration and medication reminder. Observe and document client conditions according to company standards; report unusual events or changes in the client's condition to the immediate Supervisor. Understand and implement infection prevention practices. Complete required annual education and participate in ongoing internal and\/or external education activities. Adhere to Company’s Policies and Procedures. Maintains confidentiality of client and company information and discusses same only with appropriate personnel. Complete other tasks as required.","Title":"Personal Support Worker\/Retirement Home","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Personal-Support-WorkerRetirement-Home.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"will perform in the capacity of an RPN.","Title":"Registered Practical Nurse","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Registered-Practical-Nurse.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"General Labour","Description":"The Press Operator will be responsible for working on the production line. The Press Operator is accountable for the operation of equipment for the manufacturing of various parts, and operate machines safely and efficiently to ensure the overall quality of the products. Responsibilities Maintain the quality and integrity of parts being produced; Recognize areas of defect and take the appropriate actions to rectify; Perform quality inspections as necessary; Follow all production procedures; Maintain cleanliness of equipment and assigned work area at all times; Daily housekeeping and maintaining equipment and surrounding work area; Uphold all health & safety rules and regulations per JNM\/WMT Health & Safety Manual and Ontario’s Occupational Health & Safety Act; Uphold all employment standards, company policies and procedures; Prompt and regular attendance and working all assigned hours; Perform any other duties, as required.","Title":"Press Operator","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Press-Operator.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Food Counter Attendant \/ Kitchen Helper","Description":"will assist with preparing foods, assist the cook, do the dishes, other related duties","Title":"Prep cook\/ Dishwasher","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Prep-cook-Dishwasher.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Food Counter Attendant \/ Kitchen Helper","Description":"- Washing, chopping, shredding, and grating ingredients for the chef - Quickly fulfill food orders - Packaging customers' leftover food upon request - Cleaning dishes, work stations, cooking equipment, and food storage areas - Sweeping and mopping floors - Gathering and removing garbage - Sanitizing tables and chairs before and after customers' leave their eating area","Title":"Kitchen Staff","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Kitchen-Staff-.aspx","Contact":"jsimpson@citywindsor.ca "},{"Category":"Food Counter Attendant \/ Kitchen Helper","Description":"- Pleasantly deal with guest to ensure satisfaction - Operating the cash register and handling cash \/ debit \/ credit transactions with guests. - Balances cash drawer at the end of each shift and is responsible for any variance. - Bag, box or wrap packages - Operate both the Deli and sandwich counters - Ensure front counter has a full stock of impulse items for purchase - Take guest orders in person or over the phone. - Handle guest returns and make decisions on exchanges and refunds as required. - Make sales referrals, cross-sell products and introduce new ones - Resolve guest complaints, guide them and provide relevant information - Greet guests when entering or leaving establishments - Maintain clean and tidy checkout areas - Assist in the food production area as required - Any other tasks as deemed necessary.","Title":"Guest & Food Services","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Guest-Services-.aspx","Contact":"jsimpson@citywindsor.ca "},{"Category":"Transportation \/ Logistics","Description":"(Kitchen\/Flooring\/Plumbing Materials) Delivery to a customers premises Provide onsite customer service Driving and Maintaining company delivery trucks Loading customers Cleaning and maintaining warehouse to ensure safety compliance.","Title":"Delivery Driver","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Delivery-Driver.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Security","Description":"What you’ll be doing Ensure the protection of people, assets and property Monitor access of entryways and exit points using equipment at your disposal Conduct preventive surveillance rounds according to established procedures Provide impeccable customer service Prevent fire, theft and vandalism Verify and inspect safety equipment Enforce the regulations in effect at your client's premises Write daily reports and incident reports What we offer Competitive wages Complete uniform Diverse work assignements Career development and advancement, and training opportunities We offer flexible schedules, diverse work assignments spanning multiple industries, and training and career advancement opportunities. We embrace diversity and welcome newcomers, women, students, retirees, reservists, veterans, and more to join our team, as we are proud to be an equal opportunity employer.","Title":"Security Guard (Casual)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Security-Guard-(Casual)-.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Accounting \/ Bookkeeping","Description":"Are you an accounting professional looking for a new leadership opportunity? What will your typical day look like? This will be a market-facing role for potential client opportunities; included but not limited to, calling & meeting clients, discussing client needs, and finding an appropriate solution. You’ll prepare proposals and work with our internal teams efficiently to execute client service delivery, build and own relationships with clients and deliver on bookkeeping, analytics and year-end work. You’ll leverage class leading cloud accounting software to enhance the client experience, and find efficiencies in work flow. This individual will oversee the day to day operations for a team of virtual and in-house Bookkeepers. You will equip teams with the necessary direction and develop tools to deliver client service excellence. You will coach, develop and manage a team of Bookkeepers and work with the Senior Managers to establish strategies aligned with the group’s goals. You will have a deep understanding of service priorities (growth, technology, client satisfaction etc.). About the team We are looking to hire a Manager to work within our Accounting Services Group and support the team. This group is growing rapidly and we look forward to adding to this dynamic team. This group collaborates with client delivery teams to carry out tasks required to complete cloud accounting services for small and medium private clients in various business sectors. A one-stop shop that offers client services at a fixed monthly price.","Title":"Accounting Services Manager","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Accounting-Services-Coordinator.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"Effectively utilizing the nursing process to provide high quality nursing care to residents  Supervisory duties including ensuring excellent care services to Seasons’ residents and providing mentoring\/education\/guidance to care team on an ongoing basis  Assessments of residents moving into Seasons community and following up with residents throughout the transition to community (6 month re-assessments of residents per RHRA regulations, as health care changes)  Establish priorities based on individual resident needs  Providing person centered service plans  Ensuring compliance with Resident Assessments\/Service Plans (PCC) while following community specific policies, procedures, and all applicable regulations  Risk management by adhering to thorough monthly care related audits  Medication administration (PCC knowledge an asset)","Title":"Care Coordinator (Amherstburg)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Care-Coordinator.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Healthcare \/ Fitness","Description":"Effectively utilizing the nursing process to provide high quality nursing care to residents  Supervisory duties including ensuring excellent care services to Seasons’ residents and providing mentoring\/education\/guidance to care team on an ongoing basis  Assessments of residents moving into Seasons community and following up with residents throughout the transition to community (6 month re-assessments of residents per RHRA regulations, as health care changes)  Establish priorities based on individual resident needs  Providing person centered service plans  Ensuring compliance with Resident Assessments\/Service Plans (PCC) while following community specific policies, procedures, and all applicable regulations  Risk management by adhering to thorough monthly care related audits  Medication administration (PCC knowledge an asset)","Title":"Care Coordinator - Memory Care (Amherstburg)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Care-Coordinator---Memory-Care.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Professional Services","Description":"The Engineering clerk position consists of, but not limited to, the following sub-categories: Purchaser CAD detailer Office assistant Task manager Maintain cleanliness of CMM room Meeting Minutes. Shipping Inspection Die in Press Duties Shipping Duties Project management Support Server “cleanup” procedure Quality Gates to Manage","Title":"Engineering Clerk","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Engineering-Clerk.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Professional Services","Description":"Collaborate with other WDBA departments and established working groups and\/or committees in the creation, implementation and maintenance of their project plans delivering on WDBA’s Project Agreement obligations and that of their oversight plans ensuring Bridging North America delivers on Project Agreement obligations. Monitor action items and ensure following up as required. Provide status updates to Director, Project Controls. • Support the Director in managing WDBA’s Project Management Plan (PMP), ensuring the necessary plans, reporting and KPIs to achieve obligations set out in the Project Agreement are met. • Support the Director in managing\/tracking both internal and external performance audits, ensuring task owners fulfill their obligations. Provide recommendations to resolve deficiencies. Work collaboratively with EPMO team to support EPMO deliverables as outlined in the Project Management Plan. • Collaborate with Project Controls team and Enterprise Risk Manager to monitor project performance (cost, schedule, risk and quality), identify deficiencies, research and recommend continuous improvements. • Collaborate with delivery team to ensure successful execution of the project(s) ensuring the delivery team has the necessary tools and resources to accomplish their tasks.","Title":"Project Manager Controls","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Project-Manager-Controls.aspx","Contact":"uostapovitch@citywindsor.ca"},{"Category":"Cook","Description":"The Shelter Cook is a valuable member of the Centre team, coordinating and over-seeing all Centre food-related supports within the shelter and off-site shelter for families. Providing the daily meals for 17+women, healthy snacks, menu planning, and grocery shopping services for all Centre programs assists in creating a positive, supportive, and holistic view of wellness, with a focus on balanced and healthy meals prepared with fresh ingredients. · Plan monthly menu · Adhere to all Canada Food Guidelines in menu planning · Monitor weekly, monthly and annual Centre food budget(s) for food items and associated costs · Prepare all Centre lunch and dinner meals Monday-Friday per the created menus, and leave-ahead meals for Saturday\/Sunday lunch and dinner · Ensure adequate daily breakfast and snack items are available for client use · Ensure cleanliness of all kitchen area and equipment daily and per monthly kitchen cleaning schedule · Ensure all fridge and freezer items are properly stored, labelled, used and disposed of according to Safe Food Handling Guidelines · Ensure weekly menu is posted for staff and clients by Friday of each week for the following week · Complete shelter food inventory weekly · Purchase or over-see purchasing of all food-related items · Document all menu items, recipes, and posted menus and keep records of all posted menu items","Title":"Cook - URGENTLY HIRING","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Cook---URGENTLY-HIRING.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Education \/ Community Support and Social Services","Description":"The Trainer will work closely with other project team members, as well as clinical and non-clinical staff to gain a thorough understanding of the new Cerner Millennium Hospital Information System (HIS) and the associated workflows to deliver training content to meet the needs of end users for successful adoption. The Trainer will ensure comprehensive understanding of hospital information systems, and will collaborate with subject matter experts to ensure that the training curriculum accurately reflects the clinical workflows of end users. Additionally, the Trainer will deliver classroom-based training both virtually and in-person, to end users. WHAT YOU’LL DO: · Work with a dynamic team to understand training needs and develop strategies to meet those needs · Gain proficiency in Cerner Millennium and the clinical workflows for the roles to be trained · Build, test, and maintain the training environment and training materials · Coach, mentor and train end users on the new HIS functionality through effective facilitation processes · Monitor and report training milestone achievements over the course of the initial implementation and product sustainability · Collect feedback from trainees in class and communicate that information to the appropriate e-VOLVE project team members · Following up on any outstanding questions that arise in the classroom or report concerns captured by other e-VOLVE project team members · Update training materials · Develop and adapt training material, learning assessment and validation tools. · Prepare, set up and facilitate the virtual and in-person class\/classroom · Administer end-user proficiency assessments and checklists · Support end users at go-live with at-the-elbow and Super User support · Administer post-go-live refresher, optimization, and skills-enhancement training · Train and support users to use technology in a consistent manner that promotes optimal delivery of quality patient care, patient safety, and confidentiality. · Provide inputs into ongoing post-live training and support Troubleshoots problems and questions from end users ABOUT US: TransForm Shared Service Organization, a non-profit, unique, innovative, results-driven organization founded by hospitals in the Erie St. Clair region. Our services include: information technology and information management support, sourcing and contract management, purchasing and logistics services, as well as project management. Our Mission is to deliver exceptional service and create new innovative ways to support the health system by enhancing value and improving patient outcomes. If you are service oriented, dedicated to exceeding performance expectations and interested in reaching your full potential, TransForm is for you! We welcome and appreciate your interest in our organization. Want to know more about TransForm? Visit our website!","Title":"Trainer","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Trainer.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"Uzor Manufacturing is a fast-growing window & door manufacturing company currently accepting resumes for Production Team Members. Looking for dedicated hard-working people who can think on their feet. Not your typical production job. Candidates are required to perform various tasks throughout the day and must always be willing to learn new things. We offer every employee to grow, improve and move up in the company. Assemble windows and doors, use basic hand tools, chop saws, table saws, drills, transport materials, finished products and packaging materials, Clean work areas and equipment, Feed and unload processing machines, Check products and packaging for basic quality defects, Assist process control and machine operators in performing their duties.","Title":"Production Team Member - Window Assembly","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Production-Team-Member---Window-Assembly.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"We are a local HVAC company specializing in residential and small commercial HVAC work. Looking for energetic individuals who are capable of working well in a team environment and can think outside the box. We have full-time work, looking for individuals with a minimum gas fitters 2 license and a clean driving record. Opportunities for apprenticeships are available for the ideal candidate. Sheet metal 308A and 313D licences are a bonus. We offer benefits (Green Shield), life insurance and tool replacement allowance. If you feel like a worthy candidate please send us your resume. Starting wage based upon experience. Benefits: Extended health care Vision care Dental care Company car Life insurance Job Types: Full-time, Permanent Salary: $17.00-$30.00 per hour","Title":"HVAC Installer","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/HVAC-Installer.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Manufacturing \/ Skilled Trades","Description":"To support our continued growth and provide excellence in customer service and satisfaction, Reliance Home Comfort is looking for a high energy and results focused individual for the following role: Position: Junior Technician\/Junior Installer Location: Windsor, ON About the Company For the past 50 years, Reliance Home Comfort has been the industry leader in providing home comfort solutions to over 1.9 million customers across North America. Reliance™ has been providing affordable, reliable home heating, cooling, hot water, water purification, electrical, plumbing & Smart Home products & services. Our customers know they can count on us for fast, friendly, knowledgeable service and advice – and that’s comfortable! Our organization has grown exponentially in size and we are incredibly proud to be recognized recently by: Waterstone Human Capital Ltd. as Canada’s 10 Most Admired Corporate Cultures Waterstone Human Capital Ltd. for Canada’s Most Admired CEO (Sean O’Brien) Glassdoor as “Best Places to Work in Canada” Each day, 2,300 Reliance Team Members focus on delivering an outstanding customer experience, developing top talent and giving back to the communities where we live and work. In 2019 alone, we have donated over $650,000 to United Way and $100,000 in equipment to Habitat for Humanity. Reliance is passionate about our team members’ growth and success. We proudly offer a Technical Training Assistance Program, access to tuition reimbursement and additional paid apprentice leave for eligible team members.~To support our continued growth and provide excellence in customer service and satisfaction, Reliance Home Comfort is looking for a high energy and results focused individual for the following role: Position: Junior Technician\/Junior Installer Location: Windsor, ON About the Company For the past 50 years, Reliance Home Comfort has been the industry leader in providing home comfort solutions to over 1.9 million customers across North America. Reliance™ has been providing affordable, reliable home heating, cooling, hot water, water purification, electrical, plumbing & Smart Home products & services. Our customers know they can count on us for fast, friendly, knowledgeable service and advice – and that’s comfortable! Our organization has grown exponentially in size and we are incredibly proud to be recognized recently by: Waterstone Human Capital Ltd. as Canada’s 10 Most Admired Corporate Cultures Waterstone Human Capital Ltd. for Canada’s Most Admired CEO (Sean O’Brien) Glassdoor as “Best Places to Work in Canada” Each day, 2,300 Reliance Team Members focus on delivering an outstanding customer experience, developing top talent and giving back to the communities where we live and work. In 2019 alone, we have donated over $650,000 to United Way and $100,000 in equipment to Habitat for Humanity. Reliance is passionate about our team members’ growth and success. We proudly offer a Technical Training Assistance Program, access to tuition reimbursement and additional paid apprentice leave for eligible team members. Key Responsibilities: Responsible to work in Service, performing tank refurbishments and parts harvesting, progressing to water heater repair or assistance roles\/duties in the field or in the warehouse as assigned. Responsible to professionally install HVAC or Water Heater equipment and accessory items in accordance with manufacturer specifications and local codes. Correctly instruct customers on proper care and maintenance","Title":"Jr Installer or Technician","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Jr-Installer-or-Technician.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Warehousing \/ Distribution","Description":"Crawford Packaging is looking to fill the position of Warehouse Supervisor for our new Essex location, reporting to the Warehouse Manager. This is a lead by example position. In this role you will provide hands-on leadership to warehouse employees by training, monitoring, and evaluating assigned personnel and by actively leading the receiving, warehousing, and shipping of product in a manner consistent with company culture, and service. This position is also responsible for the supervisor of our drivers of the Essex location. Core Responsibilities  Supervise the warehouse employees and drivers  Ongoing communication with warehouse manager and other department heads regarding any issues, problems or concerns  Coordinate and oversee all warehouse logistics  Inventory control and cycle counts  Working together keeping open communication while problem solving, in a faced pace environment with repetitive tasks, heavy lifting, bending, crouching kneeling, manual dexterity etc.  Training and orientation of new warehouse employees\/drivers  Conduct performance reviews of all warehouse employees\/drivers  Supervise and direct warehouse staff; put worker safety as a top priority  Motivate and lead warehouse staff to effectively carry out given tasks  Provide hands-on support of day to day operations  Assist with all aspects of the day to day operations of the warehouse such as: loading, unloading products, picking orders, and putting stock away while often working at heights  This position assume responsibility for the workplace safety of self and co-workers, and for the safety conditions of the work location, exercise and promotes safe behaviors and show unyielding support of programs, rules and policies regarding safety.  Other duties as required What we have to offer:  Employee benefits including health and dental after 3 months  Visibility to career growth opportunities across the entire Crawford Packaging organization  Skills development and training reimbursement  Generous vacation plan and paid sick days  Interesting and challenging work and projects Crawford Packaging is a leading distributor of packaging supplies and packaging equipment. Headquartered in London, Ontario with branch operations in Brampton, Cambridge and soon Essex. Crawford Packaging serves the Canadian market and is making significant in-roads into the US and Mexican markets. Crawford Packaging is proud to provide this unique career opportunity within a progressive environment with continuous learning and opportunity for growth, as well as a competitive compensation package. We are an equal opportunity employer. While only qualified candidates will be contacted for an interview, be sure to continually check our website for other related positions as they are posted. Crawford Packaging is committed to fair and equitable recruiting practices in accordance with the Accessibility for Ontarians with Disability Act (AODA). Persons with disabilities are encouraged to come forward at any stage of the recruitment process to request accommodations, if needed.","Title":"Warehouse Supervisor","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Warehouse-Supervisor.aspx","Contact":"khayes@citywindsor.ca"},{"Category":"Construction","Description":"Our company is looking for an experienced Carpenter to join our team. We specialize in kitchen and bathroom renovations with an emphasis on cabinet installations. Ideal candidate will excel in finish carpentry, have his\/her own transportation and be willing to travel within Essex county. Responsibilities and Duties - Site preparation - Interpret blueprints - Install cabinets (crown moldings and lightrail) - Cleanup","Title":"Cabinet Installer and or Carpenter","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Cabinet-Installer-and-or-Carpenter.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Education \/ Community Support and Social Services","Description":"Offer a wide range of supports and services to people with an intellectual disability and their families throughout Essex County. We are looking for Direct Support Workers to work part-time in various locations throughout Essex County. Up to 32 Hours per Week Days Evenings Midnights Weekends Work locations throughout Essex County include: Leamington Kingsville Tecumseh Belle River LaSalle Comber Essex McGregor Harrow Amherstburg","Title":"Direct Support Worker (Essex County)","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Direct-Support-Worker-(Essex-County)-.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Repair \/ Maintenance","Description":"Tecumseh Tire is located in Tecumseh. Located on a bus route but you must walk approx 15 minutes Change tires and install Winter tires Repair holes\/leaks Performed vehicle balancing, tire mounting Inventory Landscaping\/property maintenance (cut grass, snow removal)","Title":"Tire Technician","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Tire-Technician.aspx","Contact":"jsimpson@citywindsor.ca"},{"Category":"Construction","Description":"- overhead commerical and industrial door installation","Title":"Door Technician","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Door-Technician.aspx","Contact":"khayes@citywindsor.ca"},{"Category":"General Labour","Description":"Local company is seeking a Furniture Handler for a commercial move. This assignment is to start on December 1st for approximately 3 weeks. This could lead to permanent employment depending on need. Load, unload and move products and materials by hand or using basic material handling equipment Move household and office appliances and furniture onto and off moving trucks or vans Perform other material handling activities such as counting, weighing, sorting, packing and unpacking. Looking for a candidate that is eager to learn and will accept an entry level position with chance for increased responsibility.","Title":"Furniture Handler Temporary Assignment","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Furniture-Handler-Temporary-Assignment.aspx","Contact":"birwin@citywindsor.ca"},{"Category":"Construction","Description":"Read and interpret drawings, circuit diagrams and electrical code specifications to determine wiring layouts for new or existing installations Pull wire through conduits and through holes in walls and floors Install brackets and hangers to support electrical equipment Install, replace and repair lighting fixtures and electrical control and distribution equipment, such as switches, relays and circuit breaker panels Splice, join and connect wire to fixtures and components to form circuits Test continuity of circuits using test equipment to ensure compatibility and safety of system, following installation, replacement or repair Troubleshoot and isolate faults in electrical and electronic systems and remove and replace faulty components","Title":"Electrician\/Building Construction","Link":"\/residents\/ETSforsuccess\/JobOpportunities\/Pages\/Electrician.aspx","Contact":"birwin@citywindsor.ca"}]